{
    "1": [
        { "id": "lesson-side-header", "text": "Rotations in Computers" },
        {
            "id": "lesson-side-body",
            "text": "Just as computers have the coordinate system to figure out where to move, they also use a system called the unit circle to determine which way to point the cursor. The unit circle is made up of 360 segments called degrees. As such, turning a cursor 90 degrees is equivalent to turning it one-fourth of the circle."
        },
        {
            "id": "lesson-side-body",
            "text": "Just like the coordinate system, degrees can be either positive or negative."
        }
    ],
    "2": [
        { "id": "lesson-side-header", "text": "Positioning in Computers" },
        {
            "id": "lesson-side-body",
            "text": "Computers use the coordinate system to tell the cursor where to move. The coordinate system is a grid made of small chunks called units. The cursor starts out at the center of the grid and counts out some number of units to move. For example, the point (2, 1) would be two units RIGHT and one unit UP from the center."
        },
        {"id": "code-text", "text": "turtle.goto(-1,2)"},
        {
            "id": "lesson-side-body",
            "text": "When looking at these numbers, remember that the number to move sideways comes first. A positive number means you move right, and a negative number means you move left. And when moving up and down with the second number, a positive number means you move up and a negative means down."
        }
    ],
    "3": [
        { "id": "lesson-side-header", "text": "Moving the Cursor: turtle.goto()" },
        {
            "id": "lesson-side-body",
            "text": "There are many commands that allow us to move the cursor with Turtle. The simplest such command is goto(), which accepts arguments in the form of the pairs of numbers we saw before. In order to use it, we simply call it like this:"
        },
        {"id": "code-text", "text": "turtle.goto(-1, 2)"},
        {
            "id": "lesson-side-body",
            "text": "The above line tells the Turtle cursor to move 1 unit to the left and 2 units up from the center. Now try it yourself!"
        }
    ],
    "4": [
        { "id": "lesson-side-header", "text": "Moving the Cursor: forward() and backward()" },
        {
            "id": "lesson-side-body",
            "text": "If we don’t know exactly what position to move to, we can also tell the cursor to move some number of units either forward or backward. In order to use the forward() and backward() functions, you call them like this:"
        },
        {"id": "code-text", "text": "turtle.forward(1)"},
        {"id": "code-text", "text": "turtle.backward(2)"},
        {
            "id": "lesson-side-body",
            "text": "The above code tells the cursor to move 1 unit forward, then 2 units backward. Since the cursor points to the right at the beginning, the forward() function makes it move right and the backward() function goes left."
        }
    ],
    "5": [
        { "id": "lesson-side-header", "text": "Turning the Cursor: left() and right()" },
        {
            "id": "lesson-side-body",
            "text": "Sometimes, you may want to move the cursor in a different direction than the one it's currently pointing in. You could use goto(), but that can be messy and hard to understand. Another solution is to use the left() and right() commands to turn the cursor to the direction you want it to go, like this:"
        },
        {"id": "code-text", "text": "turtle.left(90"},
        {"id": "code-text", "text": "turtle.right(180)"},
        {
            "id": "lesson-side-body",
            "text": "These functions use the 360-degree circle to figure out how much to turn. For example, if your cursor is pointing right and you turn left 90 degrees, you'll then be pointing up."
        }
    ]

}